html/projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-21 Sun 02:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Projects</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Projects</h1>
<div id="outline-container-org8a9cee5" class="outline-2">
<h2 id="org8a9cee5"><span class="section-number-2">1.</span> Completed</h2>
<div class="outline-text-2" id="text-1">
<p>
These projects have achieved at least most of their goals.
</p>
</div>
<div id="outline-container-org37335d8" class="outline-3">
<h3 id="org37335d8"><span class="section-number-3">1.1.</span> Academic Projects</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><a href="https://digitalcollections.bowdoin.edu/view/4961/">Physics BA Honors Thesis</a>, 2023: reuse of N95 FFRs helps mitigate the effects of shortages. UV-C exposure is an ideal method for the decontamination necessary for FFR reuse. We design and program a ray tracing simulator in MATLAB to characterize the distribution of scattered photons in N95 FFRs.</li>
<li><a href="https://gitlab.com/lorenzohess/dante-site-backend">Commedia Word Counts Website</a>, 2022: search for words in the <i>Divine Comedy</i>, along with their counts and frequencies.</li>
<li><a href="https://gitlab.com/lorenzohess/eddy-current-brakes-ergometer">Eddy Current Brake Ergometer for PHYS 3010</a>, 2022: building parts of an upper body ergometer with eddy current brakes.</li>
<li><a href="https://gitlab.com/lorenzohess/me3310-stretcher-cad">Folding Stretcher CAD Model for ME 3310</a>, 2024:</li>
<li><a href="https://gitlab.com/lorenzohess/xml-commedia">XML Commedia</a>, 2022: Dante&rsquo;s <i>Divine Comedy</i> encoded as XML, down to each word.</li>
<li><a href="https://gitlab.com/lorenzohess/es-1310-cad-files">CAD Files for ES 1310</a>, 2023:</li>
</ol>
</div>
</div>
<div id="outline-container-orgee2f78f" class="outline-3">
<h3 id="orgee2f78f"><span class="section-number-3">1.2.</span> Software</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/arch-awesomewm-rice">AwesomeWM Desktop Rice for Arch Linux</a>, 2025: configuration and scripting for the Awesome Window Manager and other desktop environment tools for Arch Linux.</li>
<li><a href="https://github.com/lorenzohess/qubes-awesomewm-rice">AwesomeWM Desktop Rice for Qubes OS</a>, 2023: configuration and scripting for the Awesome Window Manager and other desktop environment tools for Arch Linux.</li>
<li><a href="https://gitlab.com/lorenzohess/divina-commandline">Divina Commandline</a>, 2022: very basic CLI tools for interacting with the <i>Divine Comedy</i> from the CLI.</li>
<li><a href="https://gitlab.com/lorenzohess/xml-orlando-furioso">XML Orlando Furioso</a>, 2023: Ariosto&rsquo;s <i>Orlando Furioso</i> encoded as XML, down to each word.</li>
</ol>
</div>
</div>
<div id="outline-container-org1bcd3c1" class="outline-3">
<h3 id="org1bcd3c1"><span class="section-number-3">1.3.</span> Mechanical</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org1f25598" class="outline-4">
<h4 id="org1f25598"><span class="section-number-4">1.3.1.</span> 3D Modeling</h4>
<div class="outline-text-4" id="text-1-3-1">
<ol class="org-ol">
<li><a href="https://github.com/lorenzohess/pill-gate-kirkland-393914">Pill Gate Gadget</a>, 2025: increases the convenience with which one can retrieve a single Vitamin D pill from Costco&rsquo;s Item <code>393914</code> bottle.</li>
<li><a href="https://gitlab.com/lorenzohess/fruit-fly-liquid-trap">Fruit Fly Liquid Trap</a>, 2024: simple 3D model of a fruit fly trap.</li>
</ol>
</div>
</div>
<div id="outline-container-org568479e" class="outline-4">
<h4 id="org568479e"><span class="section-number-4">1.3.2.</span> Laser Cutting</h4>
<div class="outline-text-4" id="text-1-3-2">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/greek-alphabetex">Greek Alphabet in LaTeX</a>, 2024: aka &ldquo;Greek AlphabeTeX&rdquo;, a reference to the LaTeX greek alphabet letters.</li>
<li><a href="https://gitlab.com/lorenzohess/self-complementary-graphs-gift">Self-Complementary Graphs</a>, 2024: visualization of fourteen self-complementary graphs (n = 1, 4, 5, 8).</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org9c7bcd8" class="outline-3">
<h3 id="org9c7bcd8"><span class="section-number-3">1.4.</span> Sports</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/water-polo-crash-course">Water Polo Crash Course</a>, 2024: a crash course in water polo, intended as review for players with some experience.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge651356" class="outline-2">
<h2 id="orge651356"><span class="section-number-2">2.</span> Development Stage</h2>
<div class="outline-text-2" id="text-2">
<p>
These projects have not achieved suitable goals and I am currently working on them. There are a lot on the list, and I usually work on some while thinking about solutions for others.
</p>
</div>
<div id="outline-container-org7dd0ad1" class="outline-3">
<h3 id="org7dd0ad1"><span class="section-number-3">2.1.</span> Software</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>NYC Street Parking Scheduler, 2025:</li>
</ol>
</div>
</div>
<div id="outline-container-org025c53c" class="outline-3">
<h3 id="org025c53c"><span class="section-number-3">2.2.</span> Mechanical</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Meat Slicer Aesthetic CAD Model, 2024:</li>
<li>Silent Pill Carry Bottle, 2025:</li>
<li>Analysis of Spring-Loaded Cable Retractor, 2025:</li>
<li>Gear Nomenclature Physical Reference, 2025:</li>
</ol>
</div>
</div>
<div id="outline-container-org66fbdf9" class="outline-3">
<h3 id="org66fbdf9"><span class="section-number-3">2.3.</span> HaptiClock</h3>
</div>
<div id="outline-container-orgcc0943b" class="outline-3">
<h3 id="orgcc0943b"><span class="section-number-3">2.4.</span> TeX Support</h3>
</div>
<div id="outline-container-org9a66d28" class="outline-3">
<h3 id="org9a66d28"><span class="section-number-3">2.5.</span> Tech Maps</h3>
</div>
</div>
<div id="outline-container-org154687b" class="outline-2">
<h2 id="org154687b"><span class="section-number-2">3.</span> Concept Stage</h2>
<div class="outline-text-2" id="text-3">
<p>
These projects&rsquo; goals are still being fully determined, and in some cases, the feasibility of the project itself is unclear.
</p>
</div>
<div id="outline-container-org7cfd1aa" class="outline-3">
<h3 id="org7cfd1aa"><span class="section-number-3">3.1.</span> Mechanical</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Premium USB Cable Retractor</li>
<li>Shower Shaving Station</li>
<li>Subaru Outback HVAC Screen Buttons</li>
</ol>
</div>
</div>
<div id="outline-container-orgcbc045f" class="outline-3">
<h3 id="orgcbc045f"><span class="section-number-3">3.2.</span> Ouroborous Tech</h3>
</div>
