html/projects.html
<div id="outline-container-org1097fd4" class="outline-3">
<h3 id="org1097fd4"><span class="section-number-3">3.3.</span> Protocol for Writing Revision Comments</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Leaving comments on writing often entails explaining different types of information. A sentence might need grammatical, spelling, vocabulary, and structural fixes. Often, a fix for one problem affects another problem. For example, a fix for a structural error may end up eliminating a word that&rsquo;s misspelled in the original. If, however, the author declines to accept the editor&rsquo;s structural fix, however, the misspelled word will remain, and still needs fixing.
</p>

<p>
In existing software such as Google Docs and Microsoft Onedrive, the editor cannot leave two comments on the misspelled word (one for spelling, and one for structure). Thus, a new system is necessary to leave multiple comments, or different types of comments, on the same word. An editor should be able to both note a spelling error and suggest a structural fix that eliminates that spelling error. If the author declines the structural fix, the spelling error comment should become visible.
</p>

<p>
We can represent comments as nodes in a tree. If one path is taken e.g. applying the fix for the structural error, then other paths may become inaccessible, e.g. applying the fix for the spelling error.
</p>

<p>
We would use keywords, e.g. <code>typo</code>, <code>structure</code>, <code>word-swap</code>, etc to represent different types of comments.
</p>

<p>
<span class="underline">Example:</span>
</p>
<ul class="org-ul">
<li>Original text: &ldquo;A misspleling and structural errors, this sentence has.&rdquo;</li>
<li>Comment 1
<ul class="org-ul">
<li><code>typo</code>: &ldquo;misspleling &rdquo; &rarr; &ldquo;misspelling&rdquo;</li>
</ul></li>
<li>Comment 2
<ul class="org-ul">
<li><code>structural</code>: &ldquo;This sentence is now correct.&rdquo;</li>
</ul></li>
</ul>

<p>
Editing Paths:
</p>
<ol class="org-ol">
<li>Original -&gt; Comment 1 -&gt; Comment 2</li>
<li>Original -&gt; Comment 2</li>
</ol>

<p>
In Path 1, we first fix the typo and can then make the structural fix. In Path 2, we first make the structural fix; this eliminates the typo, so Comment 1 becomes inaccessible. If we reversed Comment 2, though, Comment 1 would reappear.
</p>

<p>
We need some Git commit-like method for marking new comments and maybe creating a node or branch-like version history of the document and its comments.
</p>

<p>
Users can chose to show comments as inline diffs, side-by-side diffs, as notes on the side, as highlights, etc.
</p>

<p>
As a bonus, this software should be able to import any type of text-related document and output any type of text-related document.
</p>

<p>
If necessary, comments should be independent of the continuity of text. They should be able to reference portions of text from different sentences, i.e. words from different sentences can be part of the same comment.
</p>

<p>
A Global Comment is not tied to any one instance of text, but must be applied to at least one instance. These are useful when a certain fix needs to be applied multiple times. If an author always misspells a certain word, then a Global Comment would be a typo fix for that word. Instead of creating a Typo comment for each misspelling, a Global Comment can be applied to each misspelling.
</p>

<p>
This software should be local because you shouldn&rsquo;t need an internet connection. It should be cross-platform.
</p>

<p>
The commenting process during a first read-through, or when reading new writing, is different from commenting on familiar writing, because you may leave a comment that you don&rsquo;t know will need modification until you read newer writing. There should be utilities to help modify previous comments.
</p>

<p>
Users should be able to add reference text to a previous comment.
</p>
</div>
<div id="outline-container-orgfcd3f46" class="outline-4">
<h4 id="orgfcd3f46"><span class="section-number-4">3.3.1.</span> Types of Comments</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Edits can be defined as OOP classes or even simple types. Subclassing/subtyping will be used to specify more granular edits. Each Comment class/type will specify inputs and outputs.
</p>

<p>
Differentiating between types of comments allows the author to immediately see what the editor is suggesting. It avoids the editor having to explain the purpose of the comment, in some cases, and can help reduce confusion about the purpose. Also, the author can see statistics about what comments have been given. If 90% of comments are typos, which take little time to resolve, then the author can expect that reviewing and implementing the comments won&rsquo;t take as much time. If 90% of comments are major comments, e.g. restructuring, rewording, adding context, then the author can expect to spend more time reviewing and implementing them.
</p>

<ol class="org-ol">
<li>Typo :: Word -&gt; Word (modify a word)</li>
<li>Add Character
<ol class="org-ol">
<li>Add Space (add a space anywhere)</li>
</ol></li>
<li>Reword. This should be accompanied by specific adjectives which characterize why a phrase needs rewording. Is it clunky? Verbose? High register?</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orga74b0e6" class="outline-2">
<h2 id="orga74b0e6"><span class="section-number-2">4.</span> Ideas</h2>
<div class="outline-text-2" id="text-4">
<p>
There are ideas for projects, which may later enter the Concept stage.
</p>
</div>
<div id="outline-container-org003c461" class="outline-3">
<h3 id="org003c461"><span class="section-number-3">4.1.</span> Software</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>When3Meet (When2Meet Alternative): When2Meet needs several features (and it makes sense to name an updated version When3Meet):
<ul class="org-ul">
<li>option to invert already selected times if dragging over them as part of another time selection</li>
<li>ability to leave notes about (un)availability in specific future weeks, ideally as granular as each 15 minute slot</li>
<li>ability to remove people from a group after creation</li>
<li>ability change days in schedule after creation</li>
<li>slightly more modern UI</li>
</ul></li>
<li><p>
Digital Lab Notebooks backed by Git and public-key cryptography
</p>

<p>
<span class="underline">Problem:</span> lab notebooks are essential research tools. They track experimental procedure and implemented sequence, lab notes, and the genesis of creative ideas. Writing on paper, however, even in non-erasable ink, does not provide any integrity to the data and metadata that lab notebooks must track. A written note can be altered after-the-fact, providing no assurance as to the chronology of the lab notes or their data integrity.
</p>

<p>
<span class="underline">Solution:</span> use a digital lab notebook with Git to track chronology and preserve integrity as well as GPG to provide a second layer of assurance, proof of digital notebook ownership, and privacy and security via encryption.
</p>

<p>
<span class="underline">Implementation:</span> a program manages your lab notebooks starting with a root directory, which contains <code>notebooks</code>. Each <code>notebook</code> is its own Git repo and receives its own digital signatures. Users can decide the semantics of a <code>notebook</code>, for example whether one notebook corresponds to one laboratory, to one day of work, to one lab session, to one lab assistant. These can of course be mixed and matched and do not affect how the program works. All the program does is track each notebook with Git and GPG.
</p>

<p>
If a user keeps a hand-written lab notebook, then the program can use photos of the pages as evidence. They could be OCRed to provide basic search functionality.
</p></li>
<li>App to run a bunch of ROS2 command in a certain sequence.</li>
<li>Computer app to flash the screen if you haven&rsquo;t blinked in a certain time threshold.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb1c1a70" class="outline-3">
<h3 id="orgb1c1a70"><span class="section-number-3">4.2.</span> Electronic</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>TRRS Cable Tester</li>
</ol>
</div>
</div>
