org/projects.org
*** Mechanical
1. PB&J Bread Mold: a mold to make slices of bread with walls. These would hold in the PB&J better and prevent it from spilling out the sides.
2. Constant force stirring spoon
3. Delayed double toilet flusher
4. Baking soda dispenser
5. Pneumatic device for clearing used grounds from Moka espresso pot funnel
6. Wearable laptop tray: straps on to your belly and holds a small, light computer for on the go hacking.
*** Robots
1. Autonomous kitchen stirrer. Constant force. Two-axis gantry with arm.
2. Autonomous pancake stacker with butter and syrup placement.
3. Autonomous egg poacher.
4. Universal BIOS button. Spams F11, F12, Delete, etc for you.
*** Other
1. Dipping Integrity Score
** Permanent Ideas
These are ideas for project which I could conceivably accomplish, but which are unrealistic due to e.g. lack of knowledge, resources, etc.
*** Software
1. Ohm.AI: tool which can tell you the resistance of a resistor based on its color bands.
   - Integrate into AR glasses, or at least a small handheld device with a camera
   - Helps colorblind people
   - Helps everyone when the resistor band direction is unclear
   - Doesn't even need AI, could probably use just computer vision if only one resistor in the photo
     - Upgrade CV to detect resistors before processing them
     - Maybe better to use algorithms that detect presence and locations of certain colors, rather than trying to identify each band and then get the color from that?
2. DIY Professional Headshot App: phone app which helps produce the highest quality professional headshots that your phone is capable of.
   - takes a photo and can apply edits to help (brightness, noise, etc)
   - UI overlay: places guides on the screen to help make clothes, shoulders, head, and facial geometries symmetric
     - clothes
       - tie is vertical
       - lapels evenly spaced around tie
     - shoulders pose
       - equally spaced within frame
       - oriented planar to phone
       - one isn't higher than the other
     - head pose
       - centered wrto. shoulders
       - yaw and roll are zero, pitch is suitable
     - facial geometries
       - smile
       - jaw
   - identifies lighting features to fix
     - too warm/cold
     - too many shadows
     - brighter/darker areas
   - companion computer app can control the phone: view the screen, take photos, set timer, turn of camera UI overlay
** Suspended
These projects were begun, even if only in the Concept Stage, but were suspended for one reason or another. They could theoretically be resumed under certain conditions:
1. [[https://gitlab.com/lhess2021/degorge][degOrge]]: a calorie tracker in Emacs Org Mode, a [[https://www.merriam-webster.com/dictionary/portmanteau][portmanteau]] of "de-gorge" and "Org".
   - Implementation Stage: 50% of the code. I had difficulty wrapping my mind around writing Elisp code that was more than a single Emacs config setting or custom function.
   - Why Suspended: I discovered it was easy enough to count calories using written notes.
2. Bookseer: an attempt at using computer vision and OCR to identify library book spine labels and extract their Library of Congress codes, with the eventual goal of building a handheld device to identify misplaced books.
   - Implementation Stage: somewhat reliable label identification and somewhat reliable OCR.
   - Why Suspended: we learned that library books contain RFID chips in the spine and that existing products can scan these chips to identify misplaced books. Our product would only have value to the niche group of libraries with no RFID system or no money for those RFID scanner.
3. [[https://gitlab.com/lhess2021/nextcloud-temp-systray][Nextcloud temp systray]]: an idea for a systemtray widget that would disply the CPU temperature of my home Raspberry Pi server.
   - Implementation Stage: I verified an online tutorial for a systray icon with mutable state.
   - Why Suspended: I got a fan for my Pi and now it stays cool enough that I don't need to monitor the temp.
4. [[https://gitlab.com/lhess2021/qubes-split-passman][Qubes split passman]]: a split password manager system for Qubes OS which allows a password manager (e.g. Bitwarden) running in a vault Qube to send information (e..g a password) to other Qubes.
   - Implementation Stage: working python scripts for Bitwarden.
   - Why Suspended: I switched away from Qubes (to Arch Linux).
5. Latex Preview Pane Rewrite: an attempt at rewriting the Latex Preview Pane Emacs package because it had several bugs.
   - Implementation Stage: I understood most of the LPP code.
   - Why Suspended: I switched to Sioyek for PDF viewing, and it offered better functionality than LPP ever could.
6. Simple Web Calculator: attempt at programming with friends to learn Git and web development.
   - Implementation Stage: 30% of the code.
   - Why Suspended: we had learned enough and were busy with classes.
7. Threatmodel.info Website: a website which offers a template for users to design a threatmodel based on Techlore's matrix (link).
   - Implementation Stage: basic version working.
   - Why Suspended: it needs more features to actually be useful, and I lost interest.
