html/projects.html
<div id="outline-container-org9740e67" class="outline-3">
<h3 id="org9740e67"><span class="section-number-3">4.3.</span> Mechanical</h3>
<div class="outline-text-3" id="text-4-3">
<ol class="org-ol">
<li>PB&amp;J Bread Mold: a mold to make slices of bread with walls. These would hold in the PB&amp;J better and prevent it from spilling out the sides.</li>
<li>Constant force stirring spoon</li>
<li>Delayed double toilet flusher</li>
<li>Baking soda dispenser</li>
<li>Pneumatic device for clearing used grounds from Moka espresso pot funnel</li>
<li>Wearable laptop tray: straps on to your belly and holds a small, light computer for on the go hacking.</li>
</ol>
</div>
</div>
<div id="outline-container-org9caef07" class="outline-3">
<h3 id="org9caef07"><span class="section-number-3">4.4.</span> Robots</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li>Autonomous kitchen stirrer. Constant force. Two-axis gantry with arm.</li>
<li>Autonomous pancake stacker with butter and syrup placement.</li>
<li>Autonomous egg poacher.</li>
<li>Universal BIOS button. Spams F11, F12, Delete, etc for you.</li>
</ol>
</div>
</div>
<div id="outline-container-org00b73b3" class="outline-3">
<h3 id="org00b73b3"><span class="section-number-3">4.5.</span> Other</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li>Dipping Integrity Score</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgefe204e" class="outline-2">
<h2 id="orgefe204e"><span class="section-number-2">5.</span> Permanent Ideas</h2>
<div class="outline-text-2" id="text-5">
<p>
These are ideas for project which I could conceivably accomplish, but which are unrealistic due to e.g. lack of knowledge, resources, etc.
</p>
</div>
<div id="outline-container-orgb58ae99" class="outline-3">
<h3 id="orgb58ae99"><span class="section-number-3">5.1.</span> Software</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Ohm.AI: tool which can tell you the resistance of a resistor based on its color bands.
<ul class="org-ul">
<li>Integrate into AR glasses, or at least a small handheld device with a camera</li>
<li>Helps colorblind people</li>
<li>Helps everyone when the resistor band direction is unclear</li>
<li>Doesn&rsquo;t even need AI, could probably use just computer vision if only one resistor in the photo
<ul class="org-ul">
<li>Upgrade CV to detect resistors before processing them</li>
<li>Maybe better to use algorithms that detect presence and locations of certain colors, rather than trying to identify each band and then get the color from that?</li>
</ul></li>
</ul></li>
<li>DIY Professional Headshot App: phone app which helps produce the highest quality professional headshots that your phone is capable of.
<ul class="org-ul">
<li>takes a photo and can apply edits to help (brightness, noise, etc)</li>
<li>UI overlay: places guides on the screen to help make clothes, shoulders, head, and facial geometries symmetric
<ul class="org-ul">
<li>clothes
<ul class="org-ul">
<li>tie is vertical</li>
<li>lapels evenly spaced around tie</li>
</ul></li>
<li>shoulders pose
<ul class="org-ul">
<li>equally spaced within frame</li>
<li>oriented planar to phone</li>
<li>one isn&rsquo;t higher than the other</li>
</ul></li>
<li>head pose
<ul class="org-ul">
<li>centered wrto. shoulders</li>
<li>yaw and roll are zero, pitch is suitable</li>
</ul></li>
<li>facial geometries
<ul class="org-ul">
<li>smile</li>
<li>jaw</li>
</ul></li>
</ul></li>
<li>identifies lighting features to fix
<ul class="org-ul">
<li>too warm/cold</li>
<li>too many shadows</li>
<li>brighter/darker areas</li>
</ul></li>
<li>companion computer app can control the phone: view the screen, take photos, set timer, turn of camera UI overlay</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org8313ddd" class="outline-2">
<h2 id="org8313ddd"><span class="section-number-2">6.</span> Suspended</h2>
<div class="outline-text-2" id="text-6">
<p>
These projects were begun, even if only in the Concept Stage, but were suspended for one reason or another. They could theoretically be resumed under certain conditions:
</p>
<ol class="org-ol">
<li><a href="https://gitlab.com/lhess2021/degorge">degOrge</a>: a calorie tracker in Emacs Org Mode, a <a href="https://www.merriam-webster.com/dictionary/portmanteau">portmanteau</a> of &ldquo;de-gorge&rdquo; and &ldquo;Org&rdquo;.
<ul class="org-ul">
<li>Implementation Stage: 50% of the code. I had difficulty wrapping my mind around writing Elisp code that was more than a single Emacs config setting or custom function.</li>
<li>Why Suspended: I discovered it was easy enough to count calories using written notes.</li>
</ul></li>
<li>Bookseer: an attempt at using computer vision and OCR to identify library book spine labels and extract their Library of Congress codes, with the eventual goal of building a handheld device to identify misplaced books.
<ul class="org-ul">
<li>Implementation Stage: somewhat reliable label identification and somewhat reliable OCR.</li>
<li>Why Suspended: we learned that library books contain RFID chips in the spine and that existing products can scan these chips to identify misplaced books. Our product would only have value to the niche group of libraries with no RFID system or no money for those RFID scanner.</li>
</ul></li>
<li><a href="https://gitlab.com/lhess2021/nextcloud-temp-systray">Nextcloud temp systray</a>: an idea for a systemtray widget that would disply the CPU temperature of my home Raspberry Pi server.
<ul class="org-ul">
<li>Implementation Stage: I verified an online tutorial for a systray icon with mutable state.</li>
<li>Why Suspended: I got a fan for my Pi and now it stays cool enough that I don&rsquo;t need to monitor the temp.</li>
</ul></li>
<li><a href="https://gitlab.com/lhess2021/qubes-split-passman">Qubes split passman</a>: a split password manager system for Qubes OS which allows a password manager (e.g. Bitwarden) running in a vault Qube to send information (e..g a password) to other Qubes.
<ul class="org-ul">
<li>Implementation Stage: working python scripts for Bitwarden.</li>
<li>Why Suspended: I switched away from Qubes (to Arch Linux).</li>
</ul></li>
<li>Latex Preview Pane Rewrite: an attempt at rewriting the Latex Preview Pane Emacs package because it had several bugs.
<ul class="org-ul">
<li>Implementation Stage: I understood most of the LPP code.</li>
<li>Why Suspended: I switched to Sioyek for PDF viewing, and it offered better functionality than LPP ever could.</li>
</ul></li>
<li>Simple Web Calculator: attempt at programming with friends to learn Git and web development.
<ul class="org-ul">
<li>Implementation Stage: 30% of the code.</li>
<li>Why Suspended: we had learned enough and were busy with classes.</li>
</ul></li>
<li>Threatmodel.info Website: a website which offers a template for users to design a threatmodel based on Techlore&rsquo;s matrix (link).
<ul class="org-ul">
<li>Implementation Stage: basic version working.</li>
<li>Why Suspended: it needs more features to actually be useful, and I lost interest.</li>
</ul></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:lorenzohess@tutanota.com">lorenzohess@tutanota.com</a></p>
<p class="date">Created: 2025-12-21 Sun 02:55</p>
</div>
</body>
</html>
